Repository: 84000/translation-memory-resources
Catalog: post_input/toh94-C.bo.en.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་ སྒྲ་གཅན་ སྦེད་པ་ ཤིང་ སྲུངས་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བརྩོན་འགྲུས་ ཆེ ར་ དགོངས་ ལ །_། སྒེའུ་གཤེར་ དག་ གི་ དུམ་བུ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $969 “The well-gone Rāhugupta, when a forest guard, |#| Offered a piece of fresh brown ginger |#| To the thus-gone Intent on Great Diligence |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དགེ་ མཛད་ ཆུ་ཆུན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ འོད་ ནི་ འབར་བ་ ལ །_། ཆུ་ གྲང་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $970 “The thus-gone Kṣemaṃkara, when a water carrier, |#| Offered cool water |#| To the thus-gone Blazing Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སེང་གེ འི་ བློ་གྲོས་ ཁྱིམ་བདག་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མཐུ་རྩལ་ སྡུད་པ་ ལ །_། མེ་ཏོག་ བལྟ་ ན་ སྡུག་པ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $971 “The well-gone Siṃhamati, when a householder, |#| Offered delightful flowers |#| To the thus-gone Gathering Power |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་ཆེན་ གྲགས་པ་ ཤིང་ སྲུངས་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དགོངས་པ་ ཟབ་ བསྒོམས་ ལ །_། སྒྲ་དབྱངས་ དག་ གི་ མཆོད་པ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $972 “The well-gone Ratnayaśas, when a forest guard, |#| Offered melodious songs |#| To the thus-gone Cultivating Profound Realization |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དོན་ མཛད་ ཕྱུག་པོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྤོས་ སྲེག་ དེ་ ལ་ ནི །_། རྔ་བོ་ ཆེ་ དག་ བརྡུང་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $973 “The thus-gone Kṛtārtha, when a rich man, |#| Beat great drums |#| Before the thus-gone Burning Incense |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཛད་ མཐའ་ གཟིགས་པ་ ཁྱིམ་བདག་ ཚེ །_། གཙུག་ལག་ཁང་ [335b] དག་ བྱས་ ཏེ་ ཕུལ་ ནས་ ཀྱང་ །_། དེ་བཞིན་ གཤེགས་པ་ སྤོས་ ཀྱི་ གླང་པོ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $974 “The well-gone Kṛtāntadarśin, when a householder, |#| Offered a monastic temple [335.b] |#| To the thus-gone Fragrance Elephant |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྲིད་པ འི་ མེ་ཏོག་ ཁྲུས་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རྣམ་པར་ འབྱེད་ བློ་ ལ །_། ཁྲུས་རས་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $975 “The well-gone Bhavapuṣpa, when a washerman, |#| Offered bathing towels |#| To the thus-gone Discerning Mind |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཛོད་སྤུ་ ལྡན་པ་ དྲང་སྲོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བློ་གྲོས་ མཆོག་ དེ་ ལ །_། ཀུ་ཤ་ དག་ ལས་ བྱས་པ འི་ ན་བཟའ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $976 “The well-gone Ūrṇa, when a sage, |#| Offered robes made of kuśa grass |#| To the thus-gone Supreme Intelligence |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྤོབས་པ་ མཚུངས་མེད་ རྒྱལ་པོ་ རི་མོ་ མཁན །_། བྱེད་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ བཀོད་པ་པོ །_། དེ་ ལ་ མེ་ཏོག་ དག་ གི་ ཕྲེང་བ་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $977 “The well-gone Atula­pratibhāna­rāja, when a painter, |#| Offered a flower garland |#| To the thus-gone Building the Array of Qualities |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡེ་ཤེས་ རྣམ་འབྱེད་ ང་རོ་ འགྲོན་པོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བརྟུལ་ཞུགས་ སེང་གེ་ དེ་ ཡི་ ནི །_། ལམ་སྲང་ དག་ ཏུ་ གོས་ ནི་ གདིང་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཉིད་ དུ་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $978 “The well-gone Vibhakta­jñā­svara, when a visitor, |#| Covered the road with garments |#| Before the thus-gone Lion of Yogic Discipline |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སེང་གེ འི་ མཆེ་བ་ དགེ་སློང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ བློ་གྲོས་ ལ །_། ལྷུང་བཟེད་ ཆུང་ངུ་ སྐྱུ་རུ་ར ས་ བཀང་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $979 “The well-gone Siṃhadaṃṣṭra, when a monk, |#| Filled a small alms bowl with myrobalan and offered it |#| Before the thus-gone Wisdom Intelligence |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཛེས་པ ར་ གཤེགས་པ་ དེད་དཔོན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ ལྷུན་པོ་ ལ །_། སེང་གེ འི་ གདན་ཁྲི་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $980 “The well-gone Laḍitagāmin, when a captain, |#| Offered a lion throne |#| To the thus-gone Majestic Mountain of Qualities |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བསོད་ནམས་ འཁོར་ལོ ས་ སྒྱུར་ རྒྱལ་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ང་རོ་ སྦྱངས་པ་ ལ །_། རིན་པོ་ཆེ་ ལས་ བྱས་པ འི་ བླ་རེ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $981 “The well-gone Puṇya,#250 when a universal monarch, |#| Offered a jewel canopy |#| To the thus-gone Purified Roar |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཆོས་ སྒྲོན་ གདུགས་ ནི་ ཚོང་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བསྡུ་བ་ རྣམ་འབྱེད་ ལ །_། ལྷུང་བཟེད་ རིན་པོ་ཆེ་ དག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $982 “The well-gone Dharmapradīpacchatra,#251 when a merchant, |#| Offered an alms bowl with jewels |#| To the thus-gone Discerning Collocations |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བཀྲ་ཤིས་ ལྡན་པ་ ཚོང་དཔོན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གསལ་བ འི་ དཔལ་ དེ་ ལ །_། ཀུན་དགའ་ར་བ་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $983 “The well-gone Maṅgalin, when a merchant, |#| Offered pleasure groves |#| To the thus-gone Glory of Clarity |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡུལ་འཁོར་ མྱ་ངན་མེད་པ་ པོ །_། ཚོང་དཔོན་ བུ་ ཚེ་ སྟན་ རིངས་ ཕུལ་ ནས་ ཀྱང་ །_། དེ་བཞིན་ གཤེགས་པ་ [336a] ཟླ་བ་ སྣང་བ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $984 “The well-gone Aśokarāṣṭra, when the son of a merchant, |#| Readily offered a seat |#| To the thus-gone Moonlight[336.a] |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བློ་གྲོས་ སེམས་དཔའ་ ཁྱིམ་བདག་ ཚེ །_། གནས་ དང་ ཟས་ ཀྱི་ རྐྱེན་རིས་ བཅད་ ནས་ ཀྱང་ །_། བདེ་གཤེགས་ ཡོན་ཏན་ ཕུང་པོ་ འོད་ དེ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $985 “The well-gone Maticintin, when a householder, |#| Apportioned the cost of residence and food |#| Before the well-gone Light of a Mass of Qualities |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ བློ་ལྡན་ འུག་པ འི་ ཚེ །_། གོས་ དང་ ཤིང་ལེབ་ དག་ ནི་ བཞག་ ནས་ |#| ཀྱང་ །_། དེ་བཞིན་ གཤེགས་པ་ ཆོས་ ཀྱི་ སྟོབས་ དེ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $986 “The thus-gone Matimat, when an owl,#252 |#| Placed clothing and a wooden board#253 |#| Before the thus-gone Strength of Dharma |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཆོས་ སྒྲོན་ སྤྱན་ ནི་ དབུལ་པོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བློ་གྲོས་ ལྡན་ དེ་ |#| ལ །_། རྒྱ་ སྲན་ དྲུས་པ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $987 “The well-gone Dharma­pradīpākṣa, when a poor man, |#| Offered beans and millet |#| To the thus-gone Endowed with Intelligence |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཤུགས་ འདོར་ བུ་རམ་ ཆང་ མཁན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རྣམ་ གྲགས་ རྒྱལ་པོ་ ལ །_། བུ་རམ་ཤིང་ གི་ བཅུད་ ཁུ་ བཏུང་བ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $988 “The well-gone Vegajaha,#254 when a distiller of rum, |#| Offered sugarcane juice |#| To the thus-gone King of Fame |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྟོབས་ཆེན་ ཚོང་པ འི་ ཆུང་མ འི་ ཚེ །_། ཕྱེ་ ཁལ་ གསུམ་ ནི་ གཉུག་ མར་ བཞག་ ནས་ |#| ཀྱང་ །_། དེ་བཞིན་ གཤེགས་པ་ དབང་པོ་ ཐུལ་བ་ ལ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $989 “The well-gone Atibala, when the wife of a merchant, |#| Offered three bushels of flour for residents |#| To the thus-gone Senses Tamed |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཤེས་རབ་ མེ་ཏོག་ དེད་དཔོན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྟབས་ ཀྱི་ མཆོག་མ་ དེ འི །_། ལམ་སྲང་ དག་ ནི་ ཕྱག་དར་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $990 “The well-gone Prajñāpuṣpa, when a captain, |#| Swept the road clean |#| Before the thus-gone Supreme Stride |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བརྟན་པ འི་ དབྱངས་ ནི་ དེད་དཔོན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི འི་ འོད་ཟེར་ ལ །_། གོས་ ཀྱི་ བླ་རེ་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $991 “The well-gone Dṛḍhasvara, when a captain, |#| Offered a canopy of clothing |#| To the thus-gone Radiant Nectar |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ བདེ་ལྡན་ སྨད་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི་ སེམས་པ་ ལ །_། ཤི་ ཡི་ བུར་ མ་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $992 “The thus-gone Sukhita, when a prostitute, |#| Offered meat balls |#| To the thus-gone Nectar Intent |#| And in doing so first gave rise to the mind of awakening.

source: !དེ་བཞིན་ གཤེགས་པ་ དོན་ གསུང་ ཚོང་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཚོགས་ཅན་ རབ་མཆོག་ ལ །_། ཀ་ཤ འི་ གདན་ དག་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $993 “The thus-gone Arthavādin, when a merchant, |#| Offered a seat made of kuśa#255 |#| To the thus-gone Supreme Possessor of Gatherings |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དགྱེས་ གསལ་ གྲོང་རྡལ་བ་ ཡི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཙུག་ཕུད་ དགྱེས་ དེ་ ལ །_། ཁ་ར་ དག་ དང་ སྦྱར་བ འི་ བཏུང་བ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $994 “The well-gone Priyaprasanna, when a townsman, |#| Offered a sugar drink |#| To the thus-gone Crown of Delight |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སེང་ [336b] གེའི་ ཞལ་ ནི་ ཕྲེང་རྒྱུད་ ཚེ །_། བདེ་གཤེགས་ ཁ་དོག་ ཟིལ་ གྱིས་ མི་ ནོན་ ལ །_། མེ་ཏོག་ ཁལ་ བཅུ་ དག་ གིས་ གཏོར་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $995 “The well-gone Harivaktra, when a garland maker, [336.b] |#| Scattered ten bushels of flowers |#| Before the well-gone Indomitable Color |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ གཙུག་ཕུད་ ཤིང་ སྲུངས་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ཏུ་ གསལ་བ་ ལ །_། སྤོས་ དང་ ཨ་མྲ འི་ འབྲས་བུ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $996 “The thus-gone Cūḍa, when a forest guard, |#| Offered incense and mango fruits |#| To the thus-gone Universal Clarity |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ སྣང་ མཛད་ སློང་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བཀོད་པ འི་ རྒྱལ་པོ་ ཡི །_། བཤོས་ དག་ བདག་ཉིད་ བཙོངས་ ཏེ་ སྦྱར་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $997 “The thus-gone Roca, when a beggar, |#| Sold himself to provide food |#| For the thus-gone King of the Array |#| And in doing so first gave rise to the mind of awakening.”

source: སངས་རྒྱས་ སྟོང་ གི་ སྔོན་ གྱི་ སྨོན་ལམ་ གྱི་ ཚུལ་ རྫོགས་ སྷོ །།_།།
en: $998 This completes the account of the previous aspirations of the one thousand buddhas.#256

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ འི་ ཚེ་ ཚིགས་ སུ་ བཅད་པ་ འདི་དག་ བཀའ་ སྩལ་ ཏོ །_།
en: $999 At that time the Blessed One spoke these verses:

source: དེ་ལྟ ར་ སངས་རྒྱས་ དག་ ལ་ཆུང་བ་ ཡི །_། ཡོན་ ཕུལ་ རྣམ་པར་ སྨིན་པ་ འདི་དག་ ཡིན །_།
en: “Such is the ripening |#| Of small donations made to buddhas.

source: འཁོར་ ཚེ་ དེ་ ཡི་ འབྲས་བུ་ དེ་ འདྲ་ ན །_། |#| མཁས་པ་ སུ་ཞིག་ བྱང་ཆུབ་ སེམས་ མི་ སྐྱེད །_།
en: Given that the effects in saṃsāra are of this kind, |#| What knowledgeable person would not give rise to the mind of awakening?

source: ནམ་མཁའ་ དག་ ནི་ ཚད་ དག་ གཟུང་བ་ དང་ །_། རྒྱ་མཚོ་ ཆེན་པོ་ མཐར་གྱིས་ བགྲང་ ནུས་ ཀྱི །_།
en: $1000 “It may be possible to comprehend the extent of the sky, |#| And it may be possible to gradually measure the great ocean, |#| Yet

source: སངས་རྒྱས་ དག་ ལ་ དད་པ་ ཤས་ ཙམ་ གྱི །_། |#| བསོད་ནམས་ ཚད་ གཟུང་བ ར་ ནི་ ནུས་པ ར་ དཀའ །_།
en: it is hard to measure the merit |#| Of even slight faith in the buddhas.

source: ཇི་སྲིད་ མྱ་ངན་ འདས་ བདེ་ མ་ རེག་པ ར །_། དེ་སྲིད་ མི་ ཁོམ་ སྡུག་བསྔལ་ མྱོང་ མི་ འགྱུར །_།
en: $1001 “Until reaching the bliss of nirvāṇa, |#| One will not have to suffer the pains of inopportune states.

source: དེ་བ ས་ རྒྱལ་བ་ བསོད་ནམས་ ཞིང་ ཐོབ་ ནས །_། |#| བག་ ཡོད་ མི་ ཡིས་ བཀུར་སྟི་ མཆོད་པ་ གྱིས །_།
en: Therefore, when they have attained the victorious fields of merit, |#| Humans should honor and worship with care.

source: སངས་རྒྱས་ དག་ ལ་ ལྷག་པ ར་ མོས་པ འི་ ཚེ །_། བདེ་གཤེགས་ མྱ་ངན་ འདས་པ འི་ སྐུ་གདུང་ ལ །_། མཆོད་པ་ ཆུང་ཤ ས་ བྱེད་པ འི་ ཡོན་ཏན་ མཐའ །_། བསམ་པ ར་ ནུས་ མ་ ཡིན་ ན་ |#| དེ་ལྟ་ ཞོག _།
en: $1002 “When, deeply inspired by the buddhas, |#| One presents even small offerings before the relics |#| Of the well-gone ones who have attained nirvāṇa, |#| The extent of the associated qualities is impossible to grasp, so keep that in mind!

source: བྱང་ཆུབ་ སེམས་ ཀྱིས་ རྒྱལ་ ལ་ ཡོན་ ཕུལ་ དང་ །_། གང་དག་ ཚད་ མེད་ ཆོས་ འདི་ བཞི་པོ་ དང་ །_། ནམ་མཁ འི་ ཁམས་ དང་སེམས་ ཅན་ ཁམས་ རྣམས་ དག _། |#| སྟོན་པ་ མ་གཏོགས་ ཤེས་པ ར་ ནུས་པ་ མེད །_།
en: $1003 “Offerings to the victorious ones by means of the mind of awakening, |#| These four boundless Dharma teachings, |#| And the realms of space and of sentient beings |#| Can only be understood by the Teacher, and no one else.

source: གང་ ཕྱིར་ སེམས་ཅན་ ཐམས་ཅད་ རྗེས་ གཟུང་ ཕྱིར །_། བྱང་ཆུབ་ སེམས་བསྐྱེད་ གནས་པ་ ཇི་ལྟ་ བར །_། དབུལ་པོ ས་ དཔག་ཚད་ ཁོར་ཡུག་ གཅིག་ ཙམ་ གྱི །_། གཏེར་ དག་ རྙེད་པ་ དེ་ལྟ ར་ དགའ་མ་ ཡིན །_།
en: $1004 “Compared to giving rise to and correctly abiding by the mind of awakening |#| In order to care for all sentient beings, |#| A poor person’s discovery of a treasure covering an entire league |#| Is not an occasion of happiness.

source: སངས་རྒྱས་ བྱང་ཆུབ་ ཕྱིར་ ནི་ རྒྱལ་བ་ ཡི །_། རྣམ་པར་ རོལ་པ་ བརྒྱད་ དང་ སྟོབས་ བཅུ་ དང་ །_། སེམས་ཅན་ སྡུད་པ་ ལྔ་ བརྒྱ་ དགའ་ [337a] མཛད་ བཞི །_། རྟོགས་ བྱེད་ འཇུག་པ་ དག་ ནི་ བརྒྱད་ ཁྲི་ དང་ །_། རྟོགས་པ ར་ དཀའ་བ་ བརྒྱད་ཅུ་ རྩ་ བཞི་ དང་ །_། བླ་ ན་ |#| མེད་པ འི་ སྒོ་མོ་ དྲུག་ ཁྲི་ དང་ །_། ས་ རྣམ་འབྱེད་ དང་ ཡེ་ཤེས་ བདུན་ཅུ་ དྲུག _། སངས་རྒྱས་ མཚོན་པ་ སྤྱོད་པ་ བཅྭ་ བརྒྱད་ དང་ །_། ཕ་རོལ་ གནོན་པ་ ལྔ་ དང་ བརྟན་པ་ བཅུ །_། སྤྱོད་ཡུལ་ ཐེར་འབུམ་ ཕྲག་ ནི་ བཅུ་གཅིག་ དང་ །_། གཞན་ ཡང་ སངས་རྒྱས་ དག་ གི་ ཡོན་ཏན་ གང་ །_། མཚན་ དང་ དཔེ་བྱད་ དག་ དང་ སྤྱོད་ལམ་ དག _། |#| རང་ སངས་རྒྱས་ ཀྱི་ སྤྱོད་ཡུལ་ ལམ་ མིན་ ན །_། |#| ཉན་ཐོས་ སྒྲ་ རྗེས་ འབྲང་བ འི་ སྨོས་ཅི་ དགོས །_།
en: $1005 “The victorious ones’ eightfold reveling#257 |#| For the sake of awakening, their ten powers, |#| The five hundred congregations of sentient beings, the four delights, [337.a] |#| The eighty thousand applications of realization, |#| $1006 “The eighty-four topics hard to comprehend, |#| The sixty thousand unsurpassable gateways, |#| The discernments of the grounds, the seventy-six forms of wisdom, |#| The eighteen modes of conduct that reveal the buddhas, |#| $1007 “The five subjugations of the beyond, the tenfold stability, |#| The eleven billion fields of activity, |#| The qualities of the buddhas, |#| Their marks and signs, and the modes of conduct— |#| $1008 “Since none of this is accessible even to solitary buddhas, |#| What need to speak of the hearers who follow the spoken word?

source: མཚུངས་པ་ མེད་པ་ འདྲ་བ་ ཡོད་ མིན་པ ས །_། དེས་ན་ སངས་རྒྱས་ བསམ་ མི་ ཁྱབ་ ཅེས་ བརྗོད །_།
en: Unparalleled and incomparable, |#| Buddhahood is known to be inconceivable.

source: གང་དག་ བྱང་ཆུབ་ མཆོག་རབ་ སེམས་ ཡོད་པ །_། དེ་ དང་ དེ་དག་ མི་ དམན་ མཚུངས་མེད་ སྤྱོད །_།
en: $1009 “Those intent on the highest awakening |#| Are not inferior, and their practice is unparalleled.

source: དེ་དག་ དེ་རིང་ འཇིག་རྟེན་ ནོར་ ཆེན་ རྙེད །_། |#| དེ་དག་ འཇིག་རྟེན་ ལེགས་པ ར་ འཚོ་བ ས་ འཚོ །_།
en: Discovering today the world’s great treasure, |#| They receive fine sustenance in the world.

source: བདུད་ རྣམས་ བཅོམ་ སྟེ་ བདུད་རྩི་ རེག་བྱ ས་ ནས །_། |#| ཆར་སྤྲིན་ ལྷུན་ སྡུག་ ལྟ་བུ ར་ ཚིམ་པ ར་ བྱེད །_།
en: $1010 “Conquering the māras and reaching the nectar, |#| They are satisfied by majestic rainclouds of beauty.

source: གང་དེ་ བྱང་ཆུབ་ ལ་ ཞུགས་ འཇིག་རྟེན་ སྐྱོབ །_། |#| དེ་དག་ ནོར་ བདུན་ དག་ གིས་ སྡུད་པ ར་ བྱེད །_།
en: Entering awakening, those protectors of the world |#| Gather the seven riches.

source: གལ་ཏེ་ སྡུག་བསྔལ་ བརྒྱ་ མང་ བཟོད་ བྱེད་པ །_། དེ་བ ས་ བྱང་ཆུབ་ གང་ ཞུགས་ སྐྱོ་ མི་ འགྱུར །_།
en: $1011 “Bearing hundreds of pains, |#| Those entering awakening will never be weary.

source: དེ་ ཡིས་ ཡོན་ཏན་ དེ་དག་ མྱུར་ འཐོབ་ ལ །_། འཇིག་རྟེན་ ཀུན་ གྱི་ མཆོག་མ་ དག་ ཏུའང་ འགྱུར །_།
en: Quickly attaining all these qualities, |#| They become the superiors of the entire world.

source: འདོད་པ འི་ རྒྱུ་ ཡིས་ སྡུག་བསྔལ་ མང་པོ་ མྱོང་བ ར་ འགྱུར །_། |#| གང་ གི་ རྣམ་པར་ སྨིན་པ ས་ ངན་འགྲོ ར་ ལྷུང་བ ར་ འགྱུར །_།
en: $1012 “Desires are the cause of numerous sufferings, |#| And as they ripen, beings fall into the lower realms.

source: མཐོ་རིས་ འགྲོ་ དང་ བྱང་ཆུབ་ ཡོན་ཏན་ དོན་ གྱི་ ཕྱིར །_། མཁས་པ་ སུ་ཞིག་ བྱིས་པ་ དག་ དང་ འགལ་བ ར་ བྱེད །_།
en: As they proceed to the higher realms and accomplish the qualities of awakening, |#| What wise person would commit the breaches of the immature?

source: བྱིས་པ་ འགལ་བྱེད་ མཁས་པ་ འགལ་ མི་ བྱེད །_།
en: $1013 “Breaches are made by the immature, not by the wise.

source: མི་ ཤེས་ འཁྲུལ་ ཡིན་ ཤེས་ལྡན་ དྲན་པ་ ཐོབ །_།
en: Delusion belongs to the ignorant, while the well-informed achieve recollection.

source: བླུན་པོ་ འདམ་ བྱིང་ མཁས་པ་ ཐང་ལ་ གནས །_།
en: Fools sink in swamps, while the wise reside on plains.

source: གང་དག་ ཆོས་སྤྱོད་པ་ ནི་ དེ་ ལ་ བཟོད །_།
en: Those practicing the Dharma achieve acceptance.

source: དེ་བ ས་ རིགས་པ་ ཅན་ མིན་ སྤང་བྱ་ ཞིང་ །_། གང་དག་ ཤེས་ ཡུལ་ རིགས་ལྡན་ བསྟེན་པ ར་ བྱ །_།
en: $1014 “Therefore, give up the unreasonable |#| And adhere to facts and understanding.

source: དཔལ་ དང་ གྲགས་པ་ རྙེད་པ་ སྤངས་ ནས་ ཀྱང་ །_། ཏིང་ངེ་འཛིན་ འདི་ ལ་ ནི་ རྣལ་འབྱོར་ བྱ །_།
en: Give up glory, fame, and riches, |#| And engage in the practice of this absorption.

source: སངས་རྒྱས་ རེ་རེ འི་ ཡོན་ཏན་ དྲན་པ་ ཡང་ །_། བསྐལ་ [337b] པ་ ཁྲི་ཕྲག་ ཚད་ མེད་ བཟོད་ བྱེད་ ན །_། |#| སངས་རྒྱས་ ཡོན་ཏན་ བསམ་ མེད་ སྨོས་ཅི་ དགོས །_།
en: $1015 “Given that recollecting even just a single quality of the buddhas [337.b] |#| Brings patient endurance of innumerable millennia of eons, |#| What need is there to mention the recollection of buddha qualities that are beyond the reach of thought?

source: དེ་བ ས་ སྡུག་བསྔལ་ ཉམ་ཐག་ དང་ དུ་ ལོང་ །_།
en: Therefore, wholeheartedly accept suffering and misery,

source: བཟོད་ དང་ ཏིང་འཛིན་ དག་ གི་ གོ་བགོ ས་ ལ །_། བརྩོན་འགྲུས་ རྒྱལ་མཚན་ ཚུལ་ཁྲིམས་ ཤིང་རྟ་ ཞོན །_།
en: $1016 “Don the armor of patience and absorption, |#| Raise the banner of diligence, and ride the chariot of discipline.

source: སྦྱིན་ སྟོབས་ ཤེས་རབ་ མདའ་ ཡིས་ བདུད་ བཅོམ་ སྟེ །_། |#| ཕམ་ བྱས་ བྱང་ཆུབ་ དག་ ལ་ རེག་པ ར་ གྱིས །_།
en: With the arrows of generosity, strength, and insight, |#| Defeat the māras and victoriously proceed to awakening.

source: བྱམས་པ འི་ གྲོགས་ དང་ བསྒྲུབ་པ འི་ བཤེས་གཉེན་ དང་ །_། དབྱེར་ མེད་ ཕ་རོལ་ ཕྱིན་པ་ སྤྲོ་བྱེད་ དང་ །_། སྟོང་པ འི་ གནས་ བཅས་ ཤུགས་ ཀྱི་ ཟས་ སྟེན་ ཚེ །_། ཐམས་ཅད་ མཁྱེན་པ འི་ ཡོན་ཏན་ ཐོབ་པ ར་ གྱིས །_།
en: $1017 “Always keeping to the friendship of love and practice, |#| Delight in the perfections, |#| Cherish the home of emptiness, enjoy the food of power, |#| And thus accomplish the qualities of omniscience.

source: དེ་བ ས་ ཇི་སྐད་ འདིར་ གསུངས་ རྣམ་ ངེས་ ལ །_། བག་ དང་ ལྡན་པ ས་ རྟག་ ཏུ་ སྦྱོར་བ ར་ གྱིས །_།
en: $1018 “In this way, comprehend well the teaching that is delivered here |#| And apply yourselves to it with care.

source: མཁའ་ ལ་ ངང་པ་ སྐད་ འབྱིན་ དགའ་བ་ ལྟར །_། ཐམས་ཅད་ མཁྱེན་པ་ མྱུར་ དུ་ ཐོབ་པ ར་ གྱིས །_།
en: Like geese crying with joy as they fly through the sky, |#| Move on quickly into the achievement of omniscience.”

source: མཆོག་ ཏུ་ དགའ་བ འི་ རྒྱལ་པོ་ སྔོན་བྱུང་བ་ འདས་པ འི་ དུས་ ན །_ |#| དེ་བཞིན་ གཤེགས་པ་ བརྩོན་འགྲུས་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ འཁོར་ ཐེར་འབུམ་ སྙེད་ དང་ བཅས་པ་ ཞིག་ བྱུང་བ ར་ གྱུར་ ཏེ་ དེ་ ཏིང་ངེ་འཛིན་ འདི་ སྟོན་ ཏོ །_།
en: $1019 “Prāmodyarāja, once in the past there was a thus-gone one by the name of Infinite Diligence, whose retinue numbered billions, and he taught this absorption.

source: དེ་ ཏིང་ངེ་འཛིན་ འདི་ སྟོན་པ་ ན་ དེ འི་ ཚེ་ རྒྱལ་པོ་ བསོད་ནམས་ མེ་ཏོག་ ཅེས་བྱ་བ་ ཞིག་ བྱུང་བ ས་ ཐོས་ ནས །_ |#| དེས་ བཙུན་མོ་ སྟོང་ དང་ སྲས་ སྟོང་ ལ་ སྨྲས་པ །_
en: At that time there was a king known as Flower of Merit. |#| The king heard that thus-gone one’s teaching and proceeded to speak as follows to his one thousand queens and one thousand sons:

source: ཏིང་ངེ་འཛིན་ ཟད་པ ར་ སྣང་བ་ འདི འི་ དོན་ ཀྱང་ མི་ ཤེས་ སོ །_།
en: ‘I do not know the meaning of this exhaustive illumination of absorption.

source: མ་ ཤེས་པ ས་ རྟོགས་པ ར་ བྱར་ ཡང་ མི་ ནུས་ སོ །_།
en: I do not know it, and I fail to understand.

source: དེ་ལྟ་ ཡིན་ གྱིས་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ ས་ ལེགས་པ ར་ གསུངས་པ་ ལ་ བདག་ཅག་ གིས་ རྗེས་སུ་ ཡི་ རང་བ ར་ ནི་ བྱ འོ །_།
en: Nevertheless, we shall rejoice in these fine statements of the Thus-Gone One.’

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ ལེགས་པ ར་ གསུངས་ ཤིང་ བཤད་པ འི་ ཏིང་ངེ་འཛིན་ འདི་ ལ་ རྗེས་སུ་ ཡི་ རང་བ་ བྱས་པ ས །_ དེ་དག་ རྗེས་སུ་ ཡི་ རང་བ འི་ མོད་ ལ་ བསྐལ་པ་ བརྒྱད་ ཁྲི ར་ འཁོར་བ་ བསྙིལ་ ནས་ དེ་ལས་ ཁ་ཕྱི ར་ ཕྱོགས་པ ར་ གྱུར་ ཏོ །_།
en: $1020 “As the king thus rejoiced in that blessed one’s excellent statements and explanations on this meditative absorption, he cast aside eighty thousand eons of saṃsāra and looked beyond.

source: ཁྱིམ་ཅན་ ཞེས་ བྱ་བ འི་ གཟུངས་ ཀྱང་ ཐོབ་པ ར་ གྱུར་ ཏོ །_།
en: He attained the recollection called heavenly bodies,

source: བྱང་ཆུབ་ ཇི་སྐད་ བསྟན་པ་ ལ་ ཡང་ ཐེ་ཚོམ་ མེད་པར་ གྱུར་ ཏོ །_།
en: and |#| he indeed became free from doubt with respect to this teaching of awakening.

source: དགེ་བ འི་ རྩ་བ་ དེས་ན་ སངས་རྒྱས་ སུམ་ འབུམ་ དག་ མཉེས་པ ར་ བྱས་པ ར་ གྱུར་ ཏོ །_། |#| ཐམས་ཅད་ དུ་ ཡང་ ཏིང་ངེ་འཛིན་ འདི་ ཐོབ་པ ར་ གྱུར་ ཏོ །_།
en: By the roots of virtue ensuing from that, he went on to please three hundred thousand buddhas, and from each of them he received this absorption.

source: ལོག་པ ར་ ལྟུང་བ་ དང་ །_ མི་ཁོམ་པ་ དག་ ཏུ་ ནམ་ཡང་ ལྟུང་བ ར་ མ་ གྱུར་ [338a] ཏོ །_།
en: Never again would he descend into error or inopportune states. [338.a]

source: རྒྱུ་ དེ་ ཁོ་ན ས་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ སངས་རྒྱས་ སོ །_།
en: By this very cause, he accomplished perfect and complete buddhahood.

source: མངོན་པར་ རྫོགས་པ ར་ འཚང་རྒྱ་བ ར་ འགྱུར་ རོ །_།
en: He became perfectly and completely awakened.

source: མཆོག་ ཏུ་ དགའ་བ འི་ རྒྱལ་པོ་ ཁྱོད་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ རྒྱལ་པོ་ བསོད་ནམས་ མེ་ཏོག་ ཅེས་བྱ་བ་ དེ་ ཁྱོད་ ཀྱིས་ གཞན་ ཡིན་ ནོ་ སྙམ་པ་ དེ་ལྟ ར་ བལྟ་བ ར་ མི་ བྱ་ སྟེ
en: $1021 “Prāmodyarāja, do not think that Flower of Merit, the king at that point and at that time, was someone else.

source: དེ་བཞིན་ གཤེགས་པ་ ཚེ་ དཔག་མེད་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན །_ |#| རྒྱལ་པོ་ བསོད་ནམས་ མེ་ཏོག་ ཅེས་བྱ་བར་ གྱུར་ ཏོ །_།
en: At that point and at that time, the thus-gone Amitāyus was King Flower of Merit,

source: བསྐལ་པ་ བཟང་པོ་པ འི་ དེ་བཞིན་ གཤེགས་པ་ དེ་དག་ ནི་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ སྲས་ སྟོང་ དུ་ གྱུར་ ཏོ །_།
en: and the thus-gone ones of this Good Eon were his one thousand sons.

source: དེ་ལྟ ར་ རྗེས་སུ་ ཡི་ རང་བ་ ཙམ་ གྱིས་ ཀྱང་ ཏིང་ངེ་འཛིན་ འདི་ མཐུ་ ཆེ་བ་ ཡིན་ ན་ ཀློག་པ་ དང་ །_ ལུང་ འབོགས་པ་ དང་ །_ བསྒྲུབ་པ་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ དགོས །_
en: If simply rejoicing in this absorption has that much power, what can we say about reading this, receiving its scriptural transmission, and putting it into practice?
